tianxiangyi/Design-of-Chamber-Environmental-Detection-Device/stc12c5a16s2.h
sbit RST        =   P4^7;       //复位脚,可通过编程器设置
sbit EX_LVD     =   P4^6;       //外部低压检测引脚

sbit P4SPISCLK  =   P4^3;       //SPI总线的时钟脚
sbit P4SPIMISO  =   P4^2;       //SPI总线的主出从入脚
sbit P4SPIMOSI  =   P4^1;       //SPI总线的主入从出脚
sbit P4SPISS    =   P4^0;       //SPI总线的从机选择脚

sbit P4CEX1     =   P4^3;       //比较/捕获/PWM1外部引脚
sbit P4CEX0     =   P4^2;       //比较/捕获/PWM0外部引脚
sbit P4ECI      =   P4^1;       //比较/捕获/PWM模块的外部时钟输入脚(最大值为Fosc/2)

sbit P4TXD2     =   P4^3;       //串口2数据输出脚
sbit P4RXD2     =   P4^2;       //串口2数据输入脚

/////////////////////////////////

sfr  P5         =   0xc8;       //I/O端口5              Bit7    Bit6    Bit5    Bit4    Bit3    Bit2    Bit1    Bit0
                                //位描述                -       -       -       -       P5.3    P5.2    P5.1    P5.0
                                //初始值=xxxx,1111      x       x       x       x       1       1       1       1

sbit P53        =   P5^3;       //I/O口P5.3
sbit P52        =   P5^2;       //I/O口P5.2
sbit P51        =   P5^1;       //I/O口P5.1
sbit P50        =   P5^0;       //I/O口P5.0

/////////////////////////////////

sfr  P1M1       =   0x91;       //I/O口1模式控制器1     Bit7    Bit6    Bit5    Bit4    Bit3    Bit2    Bit1    Bit0
                                //初/始值=0000,0000     0       0       0       0       0       0       0       0

/////////////////////////////////

sfr  P1M0       =   0x92;       //I/O口1模式控制器0     Bit7    Bit6    Bit5    Bit4    Bit3    Bit2    Bit1    Bit0
                                //初始值=0000,0000      0       0       0       0       0       0       0       0

/////////////////////////////////

sfr  P0M1       =   0x93;       //I/O口0模式控制器1     Bit7    Bit6    Bit5    Bit4    Bit3    Bit2    Bit1    Bit0
                                //初始值=0000,0000      0       0       0       0       0       0       0       0

/////////////////////////////////

sfr  P0M0       =   0x94;       //I/O口0模式控制器0     Bit7    Bit6    Bit5    Bit4    Bit3    Bit2    Bit1    Bit0
                                //初始值=0000,0000      0       0       0       0       0       0       0       0

/////////////////////////////////

sfr  P2M1       =   0x95;       //I/O口2模式控制器1     Bit7    Bit6    Bit5    Bit4    Bit3    Bit2    Bit1    Bit0
                                //初始值=0000,0000      0       0       0       0       0       0       0       0

/////////////////////////////////

sfr  P2M0       =   0x96;       //I/O口2模式控制器0     Bit7    Bit6    Bit5    Bit4    Bit3    Bit2    Bit1    Bit0
                                //初始值=0000,0000      0       0       0       0       0       0       0       0

/////////////////////////////////

sfr  P3M1       =   0xb1;       //I/O口3模式控制器1     Bit7    Bit6    Bit5    Bit4    Bit3    Bit2    Bit1    Bit0
                                //初/始值=0000,0000     0       0       0       0       0       0       0       0

/////////////////////////////////

sfr  P3M0       =   0xb2;       //I/O口3模式控制器0     Bit7    Bit6    Bit5    Bit4    Bit3    Bit2    Bit1    Bit0
                                //初始值=0000,0000      0       0       0       0       0       0       0       0

/////////////////////////////////

sfr  P4M1       =   0xb3;       //I/O口4模式控制器1     Bit7    Bit6    Bit5    Bit4    Bit3    Bit2    Bit1    Bit0
                                //初始值=0000,0000      0       0       0       0       0       0       0       0

/////////////////////////////////

sfr  P4M0       =   0xb4;       //I/O口4模式控制器0     Bit7    Bit6    Bit5    Bit4    Bit3    Bit2    Bit1    Bit0
                                //初始值=0000,0000      0       0       0       0       0       0       0       0

/////////////////////////////////

sfr  P5M1       =   0xc9;       //I/O口5模式控制器1     Bit7    Bit6    Bit5    Bit4    Bit3    Bit2    Bit1    Bit0
                                //初始值=xxxx,0000      x       x       x       x       0       0       0       0

/////////////////////////////////

sfr  P5M0       =   0xca;       //I/O口5模式控制器0     Bit7    Bit6    Bit5    Bit4    Bit3    Bit2    Bit1    Bit0
                                //初始值=xxxx,0000      x       x       x       x       0       0       0       0

/////////////////////////////////

// PxM1 PxM0
//  0    0     准双向口
//  0    1     强推挽输出
//  1    0     高阻输入态
//  1    1     开漏输出

/////////////////////////////////

sfr  P1ASF      =   0x9d;       //P1口模拟功能控制位    Bit7    Bit6    Bit5    Bit4    Bit3    Bit2    Bit1    Bit0
                                //位描述                P17ASF  P16ASF  P15ASF  P14ASF  P13ASF  P12ASF  P11ASF  P10ASF
                                //初始值=0000,0000      0       0       0       0       0       0       0       0

#define P17ASF      0x80        //P1.7口为ADC输入脚
#define P16ASF      0x40        //P1.7口为ADC输入脚
#define P15ASF      0x20        //P1.7口为ADC输入脚
#define P14ASF      0x10        //P1.7口为ADC输入脚
#define P13ASF      0x08        //P1.7口为ADC输入脚
#define P12ASF      0x04        //P1.7口为ADC输入脚
#define P11ASF      0x02        //P1.7口为ADC输入脚
#define P10ASF      0x01        //P1.7口为ADC输入脚

/////////////////////////////////

sfr  P4SW       =   0xbb;       //P4口的功能开关        Bit7    Bit6    Bit5    Bit4    Bit3    Bit2    Bit1    Bit0
                                //位描述                -    LVD_P4.6 ALE_P4.5 NA_P4.4  -       -       -       -
                                //初始值=x000,xxxx      x       0       0       0       x       x       x       x

#define P46EN       0x40        //传统的EA脚 0:为LVD的信号引入脚 1:为P4.6
#define P45EN       0x20        //传统的ALE脚 0:仍为ALE 1:为P4.5
#define P44EN       0x10        //传统的PSEN脚 0:无任何功能 1:为P4.4

////////////////////////////////////////////////////////////////////////////////////////////////////////////////

sfr  IE         =   0xa8;       //中断使能寄存器        Bit7    Bit6    Bit5    Bit4    Bit3    Bit2    Bit1    Bit0
                                //位描述                EA      ELVD    EADC    ES      ET1     EX1     ET0     EX0
                                //初始值=0000,0000      0       0       0       0       0       0       0       0

